ErpTest/src/AccumulationRegisters/уатВыработкаПоСтоимости/уатВыработкаПоСтоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыработкаПоСтоимости</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПараметрВыработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <comment>Маршрут</comment>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураУслуги</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПутЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатВыработкаСотрудников/уатВыработкаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыработкаСотрудников</name>
  <comment>Выработка сотрудников (уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <comment>Сотрудник</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтроительнаяРабота</name>
    <type>
      <types>CatalogRef.рар_СтроительныеРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.рар_СценарииПланированияПроектовСтроительства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатВыработкаТС/уатВыработкаТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыработкаТС</name>
  <comment>Выработка транспортных средств (уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС или оборудование</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтроительнаяРабота</name>
    <type>
      <types>CatalogRef.рар_СтроительныеРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.рар_СценарииПланированияПроектовСтроительства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатВыручка/уатВыручка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыручка</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КомиссияАвтостанции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Автостанция</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Билет</name>
    <type>
      <types>CatalogRef.уатБилеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатЗатратыТС/уатЗатратыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатЗатратыТС</name>
  <comment>Затраты на транспортные средства (уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <comment>Сумма</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Затрата</name>
    <comment>Затрата</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <comment>Статья затрат</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатИзносПробегШин/уатИзносПробегШин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатИзносПробегШин</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Пробег</name>
    <comment>Пробег, км</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Износ</name>
    <comment>Износ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбъектаЭксплуатации</name>
    <type>
      <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатОборотыПоОтчетамПоставщиковПЦ/уатОборотыПоОтчетамПоставщиковПЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатОборотыПоОтчетамПоставщиковПЦ</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <comment>Стоимость в валюте управленческого учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПластиковаяКарта</name>
    <type>
      <types>CatalogRef.уатТопливныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСотчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АЗС</name>
    <comment>АЗС</comment>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураОтчета</name>
    <comment>Номенклатура отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПластиковаяКартаОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/CommonModules/уатДатыЗапретаИзменения/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
//
// Настройка подсистемы для работы с блоком УАТ.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// Параметры:
//  Разделы - ТаблицаЗначений - с колонками:
//   * Имя - Строка - имя используемое в описании источников данных в
//       процедуре ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
//
//   * Идентификатор - УникальныйИдентификатор - идентификатор ссылки элемента плана видов характеристик.
//       Чтобы получить идентификатор нужно в режиме 1С:Предприятия выполнить метод платформы:
//       "ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку().УникальныйИдентификатор()".
//       Не следует указывать идентификаторы, полученные любым другим способом,
//       так как это может нарушить их уникальность.
//
//   * Представление - Строка - представляет раздел в форме настройки дат запрета.
//
//   * ТипыОбъектов  - Массив - типы ссылок объектов в разрезе которых можно настроить даты запрета,
//       например, Тип("СправочникСсылка.Организации"), если не указано ни одного типа,
//       то даты запрета будут настраиваться только с точностью до раздела.
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "УправлениеАвтотранспортом";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("b8448d0d-13dc-4a8f-91a5-2b437ba06fa4");
	Раздел.Представление = НСтр("ru = 'Управление автотранспортом'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатБилетныйЛист",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатВводВЭксплуатациюТСиОборудования", "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатВводНачальныхПоказаний",           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатВводОстатковГСМ",                  "Дата", "УправлениеАвтотранспортом", "Организация");        
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатВыбытиеТСиОборудования",           "Дата", "УправлениеАвтотранспортом", "Организация");          
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатВыручкаВодителей",                 "Дата", "УправлениеАвтотранспортом", "Организация");          
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатДиспозицияТС",                     "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатДТП",                              "Дата", "УправлениеАвтотранспортом", "Организация");           
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказГрузоотправителя",            "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаправкаГСМ",                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатИзменениеСчетчиковТС",             "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияГСМвТС",             "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатМаршрутныйЛист",                   "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацииСТехническимиЖидкостями",  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатОтклонениеГруза",                  "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетПоставщикаПЦ",                "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеТСиОборудования",       "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатПланированиеРаботыТС",             "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатПосадочнаяВедомость",              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеБилетов",               "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатПутевойЛист",                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатРазнарядка",                       "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатСливГСМ",                          "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатТТД",                              "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаПрейскурантовТС",         "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаТарифовЗП",               "Дата", "УправлениеАвтотранспортом", "Организация"); 
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатБилетыНаСкладах",               "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаПоСтоимости",          "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаСотрудников",          "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаТС",                   "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыручка",                       "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаказыГрузоотправителей",       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗатратыТС",                     "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатИзносПробегШин",                "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоЗаправкамГСМ",         "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоМаршрутномуЛисту",     "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ", "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГСМнаТС",                "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПланРаботыТС",                  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПростои",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРабочееВремяСотрудников",       "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасходГСМнаТС",                 "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасходТехническихЖидкостей",    "Период", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатМестонахождениеТС",                  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыРасходаГСМ",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыРасходаТехническихЖидкостей",   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатРегистрацияОснованийДляЗаказовНаТС", "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСостояниеТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСчетчикиТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатТарифыСотрудников",                  "Период", "УправлениеАвтотранспортом", "");
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, УзелПланаОбмена, СообщитьОЗапрете) Экспорт
	
КонецПроцедуры

#КонецОбласти
